# SetDefaultOpacityN

```pascal
PROCEDURE SetDefaultOpacityN(
				inPenOpacity  : INTEGER;
				inFillOpacity : INTEGER);
```

```python
def vs.SetDefaultOpacityN(inPenOpacity, inFillOpacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inPenOpacity|INTEGER|   |
|inFillOpacity|INTEGER|   |

## Examples
```pascal
SetDefaultOpacityN(1, 2);
```
```python
import vs

inPenOpacity = 1
inFillOpacity = 2

vs.SetDefaultOpacityN(inPenOpacity, inFillOpacity)
```

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes